     H COPYRIGHT('(C) Copyright Andrea Ribuoli 2021')
     D/COPY QTEMP/QRPGLESRC,WDUMP_H
     D WDUMP           PI                    
     D   InString                   100      CONST OPTIONS(*VARSIZE)
     D   OutString                  200      OPTIONS(*VARSIZE)
     D*
     C                   DUMP(A)
     C                   EVAL      OutString = InString
     C                   RETURN
