     D WDUMP_OP        PR                    OPDESC
     D   InString                   100      CONST OPTIONS(*VARSIZE)
     D   OutString                  200      OPTIONS(*VARSIZE)
