PGM        PARM(&PATH &NAME)
DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
DCL        VAR(&NAME)  TYPE(*CHAR) LEN(30)
DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
INCLUDE    SRCMBR(QP2_VARS)
INCLUDE    SRCMBR(QP2_VARS2)
CHGVAR     VAR(&PATHNAME) VALUE(&PATH)
CHGVAR     VAR(&FUNCTNAME) VALUE(&NAME)
MONMSG     MSGID(MCH3601) EXEC(CHGVAR VAR(&PATHNAME) VALUE('/QOpenSys/lib/start64'))
CHGVAR     VAR(&PATHNAME) VALUE(&PATHNAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2RUNPASE)
CHGVAR     VAR(&FUNCTNAME) VALUE(&FUNCTNAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2DLSYM)
DMPCLPGM
ENDPGM
