PGM        PARM(&PATH &NAME)
DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
DCL        VAR(&NAME)  TYPE(*CHAR) LEN(30)
DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
INCLUDE    SRCMBR(QP2_VARS)
INCLUDE    SRCMBR(QP2_VARS2)
CHGVAR     VAR(&PATHNAME) VALUE(&PATH *TCAT &NULL)
INCLUDE    SRCMBR(QP2RUNPASE)
CHGVAR     VAR(&FUNCTNAME) VALUE(&NAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2DLSYM)
IF         COND(&RETURNPTR *EQ *NULL)  THEN(DO)
CALLPRC    PRC('Qp2dlerror') RTNVAL(&ERR_P)
IF         COND(&ERR_P *NE *NULL) THEN(DO)
SNDPGMMSG  MSG(&MSG)
GOTO       CMDLBL(FINE)
ENDDO
ENDDO
FINE: DMPCLPGM
ENDPGM
