PGM        PARM(&PATH)
DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
INCLUDE    SRCMBR(QP2_VARS)
CHGVAR     VAR(&PATHNAME) VALUE(&PATH)
MONMSG     MSGID(MCH3601) EXEC(CHGVAR VAR(&PATHNAME) VALUE('/QOpenSys/lib/start64'))
CHGVAR     VAR(&PATHNAME) VALUE(&PATHNAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2RUNPASE)
DMPCLPGM
ENDPGM
