           PGM        PARM(&PATH &NAME)
           DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
           DCL        VAR(&NAME)  TYPE(*CHAR) LEN(30)
           DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
           INCLUDE    SRCMBR(QP2_VARS)
           INCLUDE    SRCMBR(QP2_VARS2)
           CHGVAR     VAR(&PATHNAME) VALUE(&PATH *TCAT &NULL)
           INCLUDE    SRCMBR(QP2RUNPASE)
           INCLUDE    SRCMBR(QP2PTRSIZE)
           IF         COND(&PTR_SIZE *EQ 4) THEN(CHGVAR VAR(&ID) VALUE(4294967295))
           IF         COND(&PTR_SIZE *EQ 8) THEN(CHGVAR VAR(&ID) VALUE(-1))
           CHGVAR     VAR(&EXP_NAME) VALUE(&NAME *TCAT &NULL)
           INCLUDE    SRCMBR(QP2DLSYM)
           IF         COND(&RETURNPTR *EQ *NULL)  THEN(DO)
           INCLUDE    SRCMBR(QP2DLERROR)
           IF         COND(&ERR_P *NE *NULL) THEN(DO)
           SNDPGMMSG  MSG(&MSG)
           GOTO       CMDLBL(FINE)
           ENDDO
           ENDDO
           INCLUDE    SRCMBR(QP2MALLOC)
           IF         COND(&PTR_SIZE *EQ 4) THEN(CHGVAR VAR(&FIRST) VALUE(-5))
           IF         COND(&PTR_SIZE *EQ 8) THEN(CHGVAR VAR(&FIRST) VALUE(-6))
           IF         COND(&PTR_SIZE *EQ 4) THEN(CHGVAR VAR(&MEMORY_P32) VALUE(&MEM_PASE32))
           IF         COND(&PTR_SIZE *EQ 8) THEN(CHGVAR VAR(&MEMORY_P64) VALUE(&MEM_PASE64))
           CHGVAR     VAR(&RESULTTYPE) VALUE(-2)
           INCLUDE    SRCMBR(QP2CALL2)
           CHGVAR     VAR(&PRO_PTR) VALUE(&MEMORY)
           SNDPGMMSG  MSG(%SST(&SECRET 1 &BUF))
FINE:
           DMPCLPGM
           INCLUDE    SRCMBR(QP2ENDPASE)
           ENDPGM
