PGM        PARM(&PATH &NAME)
DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
DCL        VAR(&NAME)  TYPE(*CHAR) LEN(30)
DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
INCLUDE    SRCMBR(QP2_VARS)
INCLUDE    SRCMBR(QP2_VARS2)
DCL        VAR(&ERR_P)  TYPE(*PTR)  ADDRESS(*NULL)
DCL        VAR(&MSG)    TYPE(*CHAR) STG(*BASED) LEN(300) BASPTR(&ERR_P)
CHGVAR     VAR(&PATHNAME) VALUE(&PATH)
MONMSG     MSGID(MCH3601) EXEC(CHGVAR VAR(&PATHNAME) VALUE('/QOpenSys/lib/start64'))
CHGVAR     VAR(&PATHNAME) VALUE(&PATHNAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2RUNPASE)
CHGVAR     VAR(&FUNCTNAME) VALUE(&NAME)
MONMSG     MSGID(MCH3601) EXEC(CHGVAR VAR(&FUNCTNAME) VALUE('atoi'))
CHGVAR     VAR(&FUNCTNAME) VALUE(&FUNCTNAME *TCAT &NULL)
INCLUDE    SRCMBR(QP2DLSYM)
             IF         COND(&RETURNPTR *EQ *NULL)  THEN(DO)
             CALLPRC    PRC('Qp2dlerror') RTNVAL(&ERR_P)
             IF         COND(&ERR_P *NE *NULL) THEN(DO)
             SNDPGMMSG  MSG(&MSG)
             GOTO       CMDLBL(FINE)
             ENDDO
             ENDDO
FINE: DMPCLPGM
ENDPGM
