DCL VAR(&PATHNAME)   TYPE(*CHAR) LEN(51)
DCL VAR(&SYMBOLNAME) TYPE(*PTR)  ADDRESS(*NULL)
DCL VAR(&SYMBOLDATA) TYPE(*PTR)  ADDRESS(*NULL)
DCL VAR(&SYMDATALEN) TYPE(*UINT) VALUE(0)
DCL VAR(&PASE_CCSID) TYPE(*INT)  VALUE(1208)
DCL VAR(&PASE_ARGV)  TYPE(*PTR)  ADDRESS(&PATHNAME)
DCL VAR(&PASE_ENV)   TYPE(*PTR)  ADDRESS(*NULL)
DCL VAR(&RETURNVAL)  TYPE(*INT)
