           PGM        PARM(&PATH)
           DCL        VAR(&PATH)  TYPE(*CHAR) LEN(50)
           DCL        VAR(&NULL)  TYPE(*CHAR) LEN(1)  VALUE(X'00')
           INCLUDE    SRCMBR(QP2_VARS)
           INCLUDE    SRCMBR(QP2_VARS2)
           CHGVAR     VAR(&PATHNAME) VALUE(&PATH *TCAT &NULL)
           INCLUDE    SRCMBR(QP2RUNPASE)
           ENDPGM
